Agustin586/Mplab_Programas/Hola Mundo/PIC18F4550/Hola_Mundo.X/Main.c
// PIC18F4550 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1L
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator (HS))
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor enabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = OFF     // CCP2 MUX bit (CCP2 input/output is multiplexed with RB3)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>

#define _XTAL_FREQ 20000000

#define PINS_TRIS       TRISB
#define PINS            PORTB
#define PULSADOR_TRIS   TRISAbits.TRISA0
#define PULSADOR_READ   PORTAbits.RA0

void Antirrebote(void);

void main(void)
{
    // Configuracion Modo digital:
    ADCON1bits.PCFG = 0b1111;
    
    // Configuracion leds:
    PINS_TRIS = 0;          // Setea como salida todo el puerto B // Es lo mismo que poner TRISB = 0;
    PINS = 0;               // Setea todos los pines en 0         // Es lo mismo que poner PORTB = 0;
    
    // Configuracion pulsador:
    PULSADOR_TRIS = 1;      // Seteamos como entrada el pinA0
    
    while(1)
    {
        if(PULSADOR_READ==1)
        {
            Antirrebote();
            PORTBbits.RB0 = 1;
            for(char i=1;i<8;i++)
            {
                __delay_ms(200);        // Esta funcion va a detener el programa durante este tiempo
                PINS = PINS << 1;       // Realiza un corrimiento hacia la izquierda 
            }
            __delay_ms(200);
            PORTB = 0;
            /**
             * Con i = 0 tenemos PORTB = 0b00000001;
             * con i = 1 tenemos PORTB = 0b00000010;
             * con i = 2 tenemos PORTB = 0b00000100;
             * .
             * .
             * .
             * con i = 7 tenemos PORTB = 0b10000000;
             */
        }
    } 
    
//    while(1)
//    {
//        if(PULSADOR_READ==1)
//        {
//            Antirrebote();
//            PORTBbits.RB0 = 1;
//            for(char i=1;i<8;i++)
//            {
//                __delay_ms(200);
//                PINS |= PINS << 1;  // Suma el valor del corrimiento al valor de bits actuales
//            }
//              /**
//               * Con i = 0 tenemos PORTB = 0b00000001;
//               * con i = 1 tenemos PORTB = 0b00000011;
//               * con i = 2 tenemos PORTB = 0b00000111;
//               * .
//               * .
//               * .
//               * con i = 7 tenemos PORTB = 0b11111111;
//               */
//            __delay_ms(200);
//            PORTB = 0;
//        }
//    }
    
    return;
}

void Antirrebote(void)
{
    __delay_ms(30);
    while(PULSADOR_READ==1) __delay_ms(30);
    
    return;
}
